"""
Интерактивно выбранные параметры
Автоматически сгенерирован interactive.py
"""
import numpy as np

# =============================================================================
# ИНТЕРАКТИВНО ВЫБРАННЫЕ ПАРАМЕТРЫ
# =============================================================================

# Выбранные пики для отслеживания [(field, freq), (field, freq)]
INTERACTIVE_SELECTED_PEAKS = [(np.float64(1740.0), np.float64(4.875871)), (np.float64(1740.0), np.float64(4.897967))]

# Поля для примеров фиттинга [field1, field2, ...]
INTERACTIVE_EXAMPLE_FIELDS = [np.float64(1741.0), np.float64(1746.0), np.float64(1738.0), np.float64(1749.0), np.float64(1735.0), np.float64(1733.0)]

